src/AccumulationRegisters/ПрослеживаемыеТовары/ПрослеживаемыеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрослеживаемыеТовары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПрослеживаемости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>26</precision>
        <scale>11</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйДокумент</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РНПТ</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комиссионер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплектующие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ПрослеживаемыеТовары/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ПрослеживаемыеТовары.НомерСтроки КАК НомерСтроки,
	|	ПрослеживаемыеТовары.Организация КАК Организация,
	|	ПрослеживаемыеТовары.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПрослеживаемыеТовары.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТовары.Характеристика КАК Характеристика,
	|	ПрослеживаемыеТовары.Партия КАК Партия,
	|	ПрослеживаемыеТовары.Количество КАК КоличествоПередЗаписью,
	|	ПрослеживаемыеТовары.Количество КАК КоличествоИзменение,
	|	ПрослеживаемыеТовары.Количество КАК КоличествоПриЗаписи,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемостиПередЗаписью,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемостиИзменение,
	|	ПрослеживаемыеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемостиПриЗаписи,
	|	ПрослеживаемыеТовары.Комиссионер КАК Комиссионер,
	|	ПрослеживаемыеТовары.Номенклатура КАК Комплектующие //BG
	|ПОМЕСТИТЬ ДвиженияПрослеживаемыеТоварыИзменение
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары КАК ПрослеживаемыеТовары");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияПрослеживаемыеТоварыИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
